# configs/ablation_B_sdfapb.yaml
nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA_SDFAPB, [1024]]    # 10 - SD-FAPB替换C2PSA

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [[-1, 6], 1, Concat, [1]]                          # 12
  - [-1, 2, C3k2, [512, False]]                        # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 14
  - [[-1, 4], 1, Concat, [1]]                          # 15
  - [-1, 2, C3k2, [256, False]]                        # 16 - P3
  - [-1, 1, Conv, [256, 3, 2]]                         # 17
  - [[-1, 13], 1, Concat, [1]]                         # 18
  - [-1, 2, C3k2, [512, False]]                        # 19 - P4
  - [-1, 1, Conv, [512, 3, 2]]                         # 20
  - [[-1, 10], 1, Concat, [1]]                         # 21
  - [-1, 2, C3k2, [1024, True]]                        # 22 - P5
  - [[16, 19, 22], 1, Detect, [nc]]                    # 23
