# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11 detect - MANet ablation: full replacement

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, MANet, [256, False, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, MANet, [512, True, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, MANet, [1024, True, 1, 3, 1, 0.5]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, MANet, [256, False, 1, 3, 1, 0.5]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, MANet, [1024, True, 1, 3, 1, 0.5]] # 22

  - [[16, 19, 22], 1, Detect, [nc]]
