# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-DCAFE-FPN: FPN全路径增强版本

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (保持原始)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# Head with FPN-DCAFE
head:
  # FPN第一层上采样 + DCAFE
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [-1, 1, DCAFE, []]                          # 12-DCAFE增强
  - [[-1, 6], 1, Concat, [1]]                   # 13-cat P4
  - [-1, 2, C3k2, [512, False]]                 # 14

  # FPN第二层上采样 + DCAFE
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [-1, 1, DCAFE, []]                          # 16-DCAFE增强
  - [[-1, 4], 1, Concat, [1]]                   # 17-cat P3
  - [-1, 2, C3k2, [256, False]]                 # 18 (P3/8-small)

  # PAN下采样路径
  - [-1, 1, Conv, [256, 3, 2]]                  # 19
  - [[-1, 14], 1, Concat, [1]]                  # 20-cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 22
  - [[-1, 10], 1, Concat, [1]]                  # 23-cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]             # 25-Detect
