# YOLO11 with Progressive Refinement Network (PRN) and ESSamp

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  n: [0.50, 0.25, 1024]  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, ESSamp, [512]]  # 5-P4/16 (ESSamp downsampling)
  - [-1, 2, C3k2, [512, True]]  # 6
  - [-1, 1, ESSamp, [1024]]  # 7-P5/32 (ESSamp downsampling)
  - [-1, 2, C3k2, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head with Progressive Refinement Network (PRN)
head:
  # PRN Layer - Stage 1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 - cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 12
  - [-1, 1, C2PSA, [512]]  # 13 - C2PSA attention
  
  # PRN Layer - Stage 2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15 - cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 16
  - [-1, 1, C2PSA, [256]]  # 17 - C2PSA attention
  
  # PRN Layer - Stage 3
  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 13], 1, Concat, [1]]  # 19 - cat PRN Stage 1
  - [-1, 2, C3k2, [512, False]]  # 20
  - [-1, 1, C2PSA, [512]]  # 21 - C2PSA attention
  
  # Detection Heads
  - [-1, 1, Conv, [512, 3, 2]]  # 22
  - [[-1, 9], 1, Concat, [1]]  # 23 - cat backbone P5
  - [-1, 2, C3k2, [1024, True]]  # 24
  - [-1, 1, C2PSA, [1024]]  # 25 - C2PSA attention
  
  # Final detection outputs (P3, P4, P5)
  - [[17, 21, 25], 1, Detect, [nc]]  # 26 - Detect(P3, P4, P5)
