# yolo11n-defectfocus.yaml
# YOLO11n + DefectFocus 完整版配置
# 适用于混凝土缺陷检测（蜂窝、麻面、露筋）

# Parameters
nc: 3  # 类别数：蜂窝、麻面、露筋
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  
  # 插入 DefectFocus 模块 - 在 P3 层
  - [-1, 1, DefectFocusAttention, [3, True, True, True]]  # 5-DefectFocus
  
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 2, C3k2, [512, True]]
  
  # 插入 DefectFocus 模块 - 在 P4 层
  - [-1, 1, DefectFocusAttention, [3, True, True, True]]  # 8-DefectFocus
  
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 11

# YOLO11n head
head:
  - [-1, 1, torch.nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4 (带DefectFocus)
  - [-1, 2, C3k2, [512, False]]  # 14

  - [-1, 1, torch.nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3 (带DefectFocus)
  - [-1, 2, C3k2, [256, False]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)
