# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-DCAFE-V2-HEAD: 高效融合版本集成在Head输入前

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]                # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]               # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]               # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]        # 4
  - [-1, 1, Conv, [512, 3, 2]]               # 5-P4/16
  - [-1, 2, C3k2, [512, True]]               # 6
  - [-1, 1, Conv, [1024, 3, 2]]              # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]              # 8
  - [-1, 1, SPPF, [1024, 5]]                 # 9
  - [-1, 2, C2PSA, [1024]]                   # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12-cat P4
  - [-1, 2, C3k2, [512, False]]                 # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15-cat P3
  - [-1, 2, C3k2, [256, False]]                 # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18-cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 10], 1, Concat, [1]]                  # 21-cat head P5
  - [-1, 2, C3k2, [1024, True]]                 # 22 (P5/32-large)

  # DCAFE_V2在Detect输入前
  - [16, 1, DCAFE_V2, []]                       # 23-P3增强
  - [19, 1, DCAFE_V2, []]                       # 24-P4增强
  - [22, 1, DCAFE_V2, []]                       # 25-P5增强
  - [[23, 24, 25], 1, Detect, [nc]]             # 26-Detect
