# # Ultralytics YOLO 🚀, AGPL-3.0 license
# # YOLO11-MANet object detection model with P3-P5 outputs

# # Parameters
# nc: 80 # number of classes
# scales:
#   # [depth, width, max_channels]
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# # YOLO11 backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [16, 3, 2]]                # 0-P1/2
#   - [-1, 1, Conv, [32, 3, 2]]                # 1-P2/4
#   - [-1, 2, MANet, [32, 32, 2, True, 2, 3]]  # 2
#   - [-1, 1, Conv, [64, 3, 2]]                # 3-P3/8
#   - [-1, 3, MANet, [64, 64, 3, True, 2, 5]]  # 4
#   - [-1, 1, Conv, [128, 3, 2]]               # 5-P4/16
#   - [-1, 3, MANet, [128, 128, 3, True, 2, 5]]# 6
#   - [-1, 1, Conv, [256, 3, 2]]               # 7-P5/32
#   - [-1, 2, MANet, [256, 256, 2, True, 2, 3]]# 8
#   - [-1, 1, SPPF, [256, 5]]                  # 9
#   - [-1, 1, C2PSA, [256, 256, 1]]            # 10

# # YOLO11 head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 11
#   - [[-1, 6], 1, Concat, [1]]                            # 12 cat backbone P4
#   - [-1, 2, MANet, [384, 128, 2, False, 2, 3]]           # 13

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]           # 14
#   - [[-1, 4], 1, Concat, [1]]                            # 15 cat backbone P3
#   - [-1, 2, MANet, [192, 64, 2, False, 2, 3]]            # 16 (P3/8-small)

#   - [-1, 1, Conv, [64, 3, 2]]                            # 17
#   - [[-1, 13], 1, Concat, [1]]                           # 18 cat head P4
#   - [-1, 2, MANet, [192, 128, 2, False, 2, 3]]           # 19 (P4/16-medium)

#   - [-1, 1, Conv, [128, 3, 2]]                           # 20
#   - [[-1, 10], 1, Concat, [1]]                           # 21 cat head P5
#   - [-1, 1, C3k2, [384, 256, 1, True]]                   # 22 (P5/32-large)

#   - [[16, 19, 22], 1, Detect, [nc]]                      # 23 Detect(P3, P4, P5)


# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Task: detect
# Custom block: MANet

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11_MANet.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (MANet)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, MANet, [256, False, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, MANet, [512, True, 1, 3, 1, 0.5]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, MANet, [1024, True, 1, 3, 1, 0.5]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11 head (MANet)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, MANet, [256, False, 1, 3, 1, 0.5]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, MANet, [512, False, 1, 3, 1, 0.5]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, MANet, [1024, True, 1, 3, 1, 0.5]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

